#include <stdio.h>

/*
ANSI控制码的说明:
// \033 写成\33或\e都可以
\033[0m 			终端默认设置
\033[1m 			设置高亮度
\033[4m				设置下划线
\033[5m 			闪烁
\33[7m 				反显,显示内容的前景色和背景色反过来 
\33[8m 				消隐,背景色覆盖前景色,字就不能显示出来
\033[背景色;前景色m
	字背景颜色范围:40----47 
		40:黑 
		41:深红 
		42:绿 
		43:黄色 
		44:蓝色 
		45:紫色 
		46:深绿 
		47:白色 
		
	字颜色:30-----------37 
		30:黑 
		31:红 
		32:绿 
		33:黄 
		34:蓝色 
		35:紫色 
		36:深绿 
		37:白色

\033[行数;列数H		设置光标位置
\033[2J  			清屏
\033[K 				清除从光标到行尾的内容
\033[s				保存光标位置 
\033[u 				恢复光标位置
\033[?25l 			隐藏光标 
\033[?25h 			显示光标
*/

int main()
{

	//system("clear");//清屏
	printf("\033[5m\33[4m\033[1m\033[2J\033[%d;30H\e[37m\e[44m%s\033[4;0H\033[0m" ,5, "hello");
	fflush(stdout);//清输出缓冲区
	printf("world\033[4;0H\033[K\033[?25l");

}
